In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from pandas import Series,DataFrame

In [3]:
#############################################################################################################################

In [4]:
#COMBINING AND MERGING DATASETS
#pandas.merge----------> joins
#pandas.concat---------->concats the tables

In [5]:
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df2 = DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})

In [6]:
df1.merge(df2,on="key") #see that only the common elements are merging

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [7]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [8]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [9]:
df1.merge(df2) #same

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [10]:
#if the columns names are different then...
df3 = DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df4 = DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})

In [11]:
df3.merge(df4,left_on="lkey",right_on="rkey")

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [12]:
#the above is an example of inner join i.e intersection
#in order to make an outer join...i.e union
df1.merge(df2,how='outer')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0
6      3   c    NaN
7    NaN   d      2

In [13]:
#similarily how="left" based on data1,how="right" based on data2..
df1.merge(df2,how="left")

   data1 key  data2
0      0   b      1
1      1   b      1
2      2   a      0
3      3   c    NaN
4      4   a      0
5      5   a      0
6      6   b      1

In [14]:
df1.merge(df2,how="right")

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0
6    NaN   d      2

In [15]:
df3.merge(df4,left_on="lkey",right_on="rkey",how='outer')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a
6      3    c    NaN  NaN
7    NaN  NaN      2    d

In [16]:
#all the above examples were many-to-one 
#NOW WE ARE GOING TO SEE MANY-TO-MANY

In [17]:
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'] ,'data1': range(6)})
df2 = DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],'data2': range(5)})

In [18]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [19]:
df2

   data2 key
0      0   a
1      1   b
2      2   a
3      3   b
4      4   d

In [20]:
pd.merge(df1,df2,how='right') #but by default it is inner join

    data1 key  data2
0       0   b      1
1       1   b      1
2       5   b      1
3       0   b      3
4       1   b      3
5       5   b      3
6       2   a      0
7       4   a      0
8       2   a      2
9       4   a      2
10    NaN   d      4

In [21]:
pd.merge(df1,df2,how="outer")

    data1 key  data2
0       0   b      1
1       0   b      3
2       1   b      1
3       1   b      3
4       5   b      1
5       5   b      3
6       2   a      0
7       2   a      2
8       4   a      0
9       4   a      2
10      3   c    NaN
11    NaN   d      4

In [22]:
left = DataFrame({'key1': ['foo', 'foo', 'bar'],'key2': ['one', 'two', 'one'], 'lval': [1, 2, 3]})
right = DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],'key2': ['one', 'one', 'one', 'two'],'rval': [4, 5, 6, 7]})

In [23]:
#to merge with multiple keys pass a list of the keys
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [24]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [25]:
#first merging on the single columns
pd.merge(left,right,on="key1") #here we have suffixes option to change key2_x to key_left...suffixes=[_left,_right]

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [26]:
#now merging on several keys
pd.merge(left,right,on=["key1","key2"])

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  bar  one     3     6

In [27]:
#this was inner
pd.merge(left,right,on=["key1","key2"],how="outer")

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  foo  two     2   NaN
3  bar  one     3     6
4  bar  two   NaN     7

In [28]:
############################################################################################################################
#merging on indexes
left2 = DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],'value': range(6)})
right2 = DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [29]:
left2

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [30]:
right2

   group_val
a        3.5
b        7.0

In [31]:
pd.merge(left2,right2,left_on="key",right_index=True) #see in order to make right_on="right's index" we do this right_index=True

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [32]:
#############################################################################################################################
#combining data with overlap.....
#THAT MEANS WHEN THE INDEX IS PARTIALLY OR TOTALLY SAME IN THE TWO SERIES OR DATAFRAME WE USE WHERE BUT HERE WE USE COMBINE.FIRST

In [35]:
df1 = DataFrame({'a': [1., np.nan, 5., np.nan],'b': [np.nan, 2., np.nan, 6.],'c': range(2, 18, 4)})
df2 = DataFrame({'a': [5., 4., np.nan, 3., 7.],'b': [np.nan, 3., 4., 6., 8.]})

In [36]:
df1

    a   b   c
0   1 NaN   2
1 NaN   2   6
2   5 NaN  10
3 NaN   6  14

In [37]:
df2

    a   b
0   5 NaN
1   4   3
2 NaN   4
3   3   6
4   7   8

In [42]:
df1.combine_first(df2) #see that this method takes the values from a if a is notnull else from b if both is null then it gives NAN

   a   b   c
0  1 NaN   2
1  4   2   6
2  5   4  10
3  3   6  14
4  7   8 NaN

In [ ]:
############################################################################################################################
#RESHAPING AND PIVOTING

In [43]:
#RESHAPING WITH HIERARCHICHAL INDEXING
#STACK----->THIS ROTATES OR PIVATES FRM COLUMNS IN THE DATA TO THE ROWS
#UNSTACK---->THIS ROTATES OR PIVOTES FROM ROWS IN THE DATA TO THE COLUMNS
data = DataFrame(np.arange(6).reshape((2, 3)),index=pd.Index(['Ohio', 'Colorado'], name='state'),columns=pd.Index(['one', 'two', 'three'], name='number'))

In [44]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [45]:
data.stack() #see that it has changed to hierachial indexing and the columsns has changed to rows

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [47]:
data.unstack() #see that the rows has changed into the coulumns

number  state
one     Ohio        0
        Colorado    3
two     Ohio        1
        Colorado    4
three   Ohio        2
        Colorado    5
dtype: int32

In [48]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from pandas import Series,DataFrame

In [3]:
data = DataFrame(np.arange(6).reshape((2, 3)),index=pd.Index(['Ohio', 'Colorado'], name='state'),columns=pd.Index(['one', 'two', 'three'], name='number'))

In [4]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [5]:
data.stack().unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [6]:
#see if we specify the level of unstacking then it will take the unstack level
data.stack().unstack(0) #this is the method of changig the rows to columns

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [7]:
data.unstack() #see it will show error because stack is column to row...but here we first unstacked it so no col.

number  state
one     Ohio        0
        Colorado    3
two     Ohio        1
        Colorado    4
three   Ohio        2
        Colorado    5
dtype: int32

In [8]:
data.stack().unstack("state") #see that it's same as out[16] because "state" is level 0

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [9]:
s1 = Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = Series([4, 5, 6], index=['c', 'd', 'e'])
data2 = pd.concat([s1, s2],keys=["one","two"])

In [10]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [11]:
data2.stack() #see this cant be stack because no column

AttributeError: 'Series' object has no attribute 'stack'

In [12]:
data2.unstack()

      a   b  c  d   e
one   0   1  2  3 NaN
two NaN NaN  4  5   6

In [13]:
data2.unstack().stack() #see that its not showing the NaN values so we'll make stack(dropna=False)

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: float64

In [14]:
data2.unstack().stack(dropna=False)

one  a     0
     b     1
     c     2
     d     3
     e   NaN
two  a   NaN
     b   NaN
     c     4
     d     5
     e     6
dtype: float64

In [15]:
#############################################################################################################################
#data transformation

In [16]:
#1.REMOVING DUPLICATES
data = DataFrame({'k1': ['one'] * 3 + ['two'] * 4,'k2': [1, 1, 2, 3, 3, 4, 4]})

In [17]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [19]:
data.duplicated() #see that the first occuring value is not shown as duplicted

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [21]:
data.drop_duplicates() #only where the duplicated array is true

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [24]:
data.drop_duplicates("k1")

    k1  k2
0  one   1
3  two   3

In [25]:
#as we have seen the drop duplicates takes the first value to be False as duplicated but to make the last value False
#we can use take_last=False
data.duplicated(take_last=False)

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [26]:
#################################TRANSFORMING DATA USING FUNCTION MAPPING###################################################

In [27]:
data = DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami','corned beef', 'Bacon', 'pastrami', 'honey ham','nova lox'], 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [28]:
data #suppose this is the data and we want to add a column indicating the type of the animal that gives the meat!

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [30]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

data["animal"]=data.map(meat_to_animal) #see here it didnot worked bcuz it is used with Series only and not with data frame

AttributeError: 'DataFrame' object has no attribute 'map'

In [31]:
#so
data["animal"]=data["food"].map(meat_to_animal)

In [32]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     NaN
4  corned beef     7.5     cow
5        Bacon     8.0     NaN
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [57]:
#can we use apply
f=lambda x: x.capitalize()
data["food"].apply(f)

0          Bacon
1    Pulled pork
2          Bacon
3       Pastrami
4    Corned beef
5          Bacon
6       Pastrami
7      Honey ham
8       Nova lox
Name: food, dtype: object

In [44]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     NaN
4  corned beef     7.5     cow
5        Bacon     8.0     NaN
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [58]:
##############################REPLACING VALUES##################################################################

In [59]:
#SUPPOSE IN THE ABOVE CASE WE WANT TO REPLACE PIG
data["animal"].replace("pig","suar")

0      suar
1      suar
2      suar
3       NaN
4       cow
5       NaN
6       cow
7      suar
8    salmon
Name: animal, dtype: object

In [60]:
data["animal"].replace(["pig","cow"],["swine","gau"])

0     swine
1     swine
2     swine
3       NaN
4       gau
5       NaN
6       gau
7     swine
8    salmon
Name: animal, dtype: object

In [62]:
##############################RENAMING AXIS INDEXES################################################

In [65]:
data.columns.map(str.upper)

array(['FOOD', 'OUNCES', 'ANIMAL'], dtype=object)

In [66]:
#we can change it by 
data.columns=data.columns.map(str.upper)

In [67]:
data

          FOOD  OUNCES  ANIMAL
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     NaN
4  corned beef     7.5     cow
5        Bacon     8.0     NaN
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [70]:
data.index=["one","two","three","four","five","six","seven","eight","nine"]

In [71]:
data

              FOOD  OUNCES  ANIMAL
one          bacon     4.0     pig
two    pulled pork     3.0     pig
three        bacon    12.0     pig
four      Pastrami     6.0     NaN
five   corned beef     7.5     cow
six          Bacon     8.0     NaN
seven     pastrami     3.0     cow
eight    honey ham     5.0     pig
nine      nova lox     6.0  salmon

In [72]:
data.rename(index=str.title)

              FOOD  OUNCES  ANIMAL
One          bacon     4.0     pig
Two    pulled pork     3.0     pig
Three        bacon    12.0     pig
Four      Pastrami     6.0     NaN
Five   corned beef     7.5     cow
Six          Bacon     8.0     NaN
Seven     pastrami     3.0     cow
Eight    honey ham     5.0     pig
Nine      nova lox     6.0  salmon

In [73]:
############################DESCRITIZATION AND BINNING##########################################################

In [76]:
#CHANGING CONTINOUS DATA INTO DISCRETE ----->DESCRITIZATION
pd.value_counts(data["FOOD"])

bacon          2
corned beef    1
Bacon          1
honey ham      1
nova lox       1
pastrami       1
Pastrami       1
pulled pork    1
dtype: int64

In [79]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins=[18, 25, 35, 60, 100] #suppose say these are the age groups
#now in order to cut the cost
categoriess=pd.cut(ages,bins)

In [80]:
categoriess

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, object): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [85]:
categoriess.levels

Index([u'(18, 25]', u'(25, 35]', u'(35, 60]', u'(60, 100]'], dtype='object')

In [84]:
categoriess.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [86]:
pd.value_counts(categoriess)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [91]:
a=np.random.randint(0,50,10)

In [92]:
a

array([19, 35, 17, 35, 39, 27, 11,  9,  2,  5])

In [95]:
pd.cut(a,4)

[(11.25, 20.5], (29.75, 39], (11.25, 20.5], (29.75, 39], (29.75, 39], (20.5, 29.75], (1.963, 11.25], (1.963, 11.25], (1.963, 11.25], (1.963, 11.25]]
Categories (4, object): [(1.963, 11.25] < (11.25, 20.5] < (20.5, 29.75] < (29.75, 39]]

In [96]:
#########################DETECTING AND FILTERING OUTLIERS####################################################

In [100]:
data=DataFrame(np.random.randint(0,1000,500).reshape(100,5))

In [102]:
data.head()

     0    1    2    3    4
0  394  867  883  941    3
1  964   62  940  572  421
2  821  558  525  608   60
3   93  488   53  813  518
4  561  763  329  527  687

In [110]:
#suppose we want the value with certain criteria out of particular columns

In [116]:
data[3][np.abs(data[3])<50] #so by this np.abs() method we get the index no. at that particular column

24    32
57    29
88    16
Name: 3, dtype: int32

In [120]:
#########################PERMUTATION AND RANDOM SAMPLING########################################################